# Perform operation on salaries dataset from Kaggle using python pandas library

In [1]:
import pandas as pd

In [2]:
sal=pd.read_csv('F:\Python\Github_upload\Salaries.csv')

In [4]:
pd.DataFrame.head(sal,2)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

### Summary if dataset read

In [5]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

## Average Max and Min values

In [6]:
sal['BasePay'].mean()

66325.44884050643

In [7]:
sal['TotalPay'].min()

-618.13

In [8]:
sal['TotalPayBenefits'].max()

567595.43000000005

## Display Employee name column and find details of a an employee

In [10]:
sal['EmployeeName']

0                 NATHANIEL FORD
1                   GARY JIMENEZ
2                 ALBERT PARDINI
3              CHRISTOPHER CHONG
4                PATRICK GARDNER
5                 DAVID SULLIVAN
6                      ALSON LEE
7                  DAVID KUSHNER
8                 MICHAEL MORRIS
9             JOANNE HAYES-WHITE
10                 ARTHUR KENNEY
11              PATRICIA JACKSON
12             EDWARD HARRINGTON
13                   JOHN MARTIN
14                DAVID FRANKLIN
15               RICHARD CORRIEA
16                      AMY HART
17                SEBASTIAN WONG
18                    MARTY ROSS
19                 ELLEN MOFFATT
20                    VENUS AZAR
21                  JUDY MELINEK
22                 GEORGE GARCIA
23                 VICTOR WYRSCH
24               JOSEPH DRISCOLL
25                  GREGORY SUHR
26                   JOHN HANLEY
27                RAYMOND GUZMAN
28                DENISE SCHMITT
29                 MONICA FIELDS
                   ...
148624        Lorraine Rosenthal
148625           Renato C Gurion
148626             Paulet Gaines
148627          Brett A Lundberg
148628            Mark W Mcclure
148629         Elizabeth Iniguez
148630              Randy J Keys
148631           Andre M Johnson
148632    Sharon D Owens-Webster
148633          Edward Ferdinand
148634            David M Turner
148635       James S Kibblewhite
148636             Andrew J Enzi
148637          Kadeshra D Green
148638      Lennard B Hutchinson
148639         Richard A Talbert
148640        Charlene D Mccully
148641     Raphael Marquis Goins
148642         Dominic C Marquez
148643                Kim Brewer
148644              Randy D Winn
148645          Carolyn A Wilson
148646              Not provided
148647            Joann Anderson
148648               Leon Walker
148649             Roy I Tillery
148650              Not provided
148651              Not provided
148652              Not provided
148653                 Joe Lopez
Name: EmployeeName, dtype: object

In [11]:
sal[sal['EmployeeName']=='Marty Ross']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
36172,36173,Marty Ross,"Battlion Chief, Fire Suppressi",174822.41,99623.51,36522.39,55353.92,310968.31,366322.23,2012,NaN,San Francisco,NaN

## Groupby based on all years and average of data classified according to year

In [14]:
sal.groupby('Year').mean()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Notes,Status
Year,,,,,,,,,
2011,18080,63595.956517,4531.065429,3617.081926,NaN,71744.103871,71744.103871,NaN,NaN
2012,54542,65436.406857,5023.417824,3653.437583,26439.966967,74113.262265,100553.229232,NaN,NaN
2013,91728,69630.030216,5281.641980,3819.969007,23829.076572,77611.443142,101440.519714,NaN,NaN
2014,129593,66564.421924,5401.993737,3505.421251,24789.601756,75463.918140,100250.918884,NaN,NaN

## No. of unique job titles also the most number of jobs for one designation

In [15]:
sal['JobTitle'].nunique()

2159

In [16]:
sal['JobTitle'].value_counts().head(1)

Transit Operator    7036
Name: JobTitle, dtype: int64

## Number of Jobs with only one occurence in the year 2012

In [19]:
sum(sal[sal['Year']==2012]['JobTitle'].value_counts()==1)

190